config/Documents/ИТ_Заявка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>ИТ_Заявка</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Аптека</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстЗаявки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ИТ_Заявка</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Закрыта</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИТ_ТипПровайдера</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправленоПоПочте</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

config/Documents/ИТ_Заявка/Ext/ManagerModule.bsl
Процедура МодульМенеджера_ЗакрытьЦепочкуЗаявок(ТекущаяЗаявка) Экспорт
	
	 
	
	Запрос=Новый Запрос();
	Запрос.Текст= "	ВЫБРАТЬ
	|		ИТ_Заявка.ДокументОснование,
	|		ИТ_Заявка.Ссылка КАК ТекЗаявка
	|	ПОМЕСТИТЬ Исх
	|	ИЗ
	|		Документ.ИТ_Заявка КАК ИТ_Заявка
	|	ГДЕ
	|		ИТ_Заявка.Ссылка = &ТекущаяЗаявка
	|	;
	|	
	|	////////////////////////////////////////////////////////////////////////////////
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ИТ_Заявка.Ссылка
	|	ИЗ
	|		Исх КАК Исх
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ИТ_Заявка КАК ИТ_Заявка
	|			ПО (Исх.ДокументОснование = ИТ_Заявка.Ссылка
	|					ИЛИ Исх.ТекЗаявка = ИТ_Заявка.Ссылка
	|					ИЛИ Исх.ДокументОснование = ИТ_Заявка.ДокументОснование
	|						И ИТ_Заявка.ДокументОснование.Ссылка ЕСТЬ НЕ NULL )
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ИТ_Заявка.Ссылка
	|	ИЗ
	|		Документ.ИТ_Заявка КАК ИТ_Заявка
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Исх КАК Исх
	|			ПО (Исх.ТекЗаявка = ИТ_Заявка.ДокументОснование)
	|	;
	|	//---------- Удаление временных таблиц --------------//
	|	УНИЧТОЖИТЬ  Исх ;
	|"; // Сгенерировано в GtG's Консоль запросов. 14.10.2013 17:42:59
	
	
	
	Запрос.УстановитьПараметр("ТекущаяЗаявка",ТекущаяЗаявка);
	
	Рез=Запрос.Выполнить().Выгрузить();
	
	Для Каждого Стр из рез Цикл
		Док=Стр.Ссылка.ПолучитьОбъект();
		Док.Закрыта=Истина;
		Док.Записать();
	КонеЦЦикла;	
	

	
КонецПроцедуры
